MaxFlatline/LM3S9B92-CMSIS-DFP/Sources/Core/src/system_lm3s9b92.c
//      <o> OSCSRC: Oscillator Source
//              <0=> 0: MOSC Main oscillator
//              <1=> 1: PIOSC Internal oscillator (default)
//              <2=> 2: PIOSC/4 Internal oscillator / 4 (this is necessary if used as input to PLL)
//              <3=> 3: 30kHz 30-KHz internal oscillator
//          <i> Chooses the oscillator that is used for the system clock,
//          <i> or the PLL input.
//
// The following value chooses the oscillator source according to the table in
// the comments above.
//
#define CFG_RCC_OSCSRC 1

//      <q> PIOSCDIS: Precision Internal Oscillator Disable
//          <i> Check this box to turn off the internal oscillator
//
// Set the following value to 1 to turn off the internal oscillator.  This
// value can be set to 1 if you are not using the internal oscillator.
//
#define CFG_RCC_PIOSCDIS 1

//      <q> MOSCDIS: Main Oscillator Disable
//          <i> Check this box to turn off the main oscillator
//
// Set the following value to 1 to turn off the main oscillator.  This
// value can be set to 1 if you are not using the main oscillator.
//
#define CFG_RCC_MOSCDIS 0

//  </h>

//********************************* RCC2 **************************************
//
//   <h> Run-Mode Clock Configuration 2 (RCC2)

//      <q> USERCC2: Use RCC2
//          <i> Check this box to override some fields in RCC.  RCC2 provides
//          <i> more bits for the system clock divider, and provides an
//          <i> additional oscillator source.  If you do not need these
//          <i> additional features, then leave this box unchecked.
//
// Set the following value to 1 to use the RCC2 register.  The RCC2 register
// overrides some of the fields in the RCC register if it is used.
//
#define CFG_RCC2_USERCC2 1

//      <q> DIV400: Divide PLL as 400 MHz vs. 200 MHz
//          <i> This bit, along with the SYSDIV2LSB bit, allows additional
//          <i> frequency choices.
//
// Set the following value to 1 to use the 400MHz PLL value and an additional
//  bit for SYSDIV2.
//
#define CFG_RCC2_DIV400 1

//      <o> SYSDIV2: System Clock Divisor <0-63>
//          <i> Specifies the divisor used to generate the system clock from
//          <i> either the PLL output of 200 MHz, or the oscillator.
//
// The following value is the system clock divisor.  This will be applied if
// USESYSDIV in RCC is enabled.  The valid range of dividers is 0-63.
//
#define CFG_RCC2_SYSDIV2 4

//      <q> SYSDIV2LSB: Additional LSB for SYSDIV2
//          <i> When DIV400 is set, this bit becomes the LSB of SYSDIV2.
//          <i> If DIV400 is clear, this bit is not used. 
//
// This bit can only be set or cleared when DIV400 is set.
//
#define CFG_RCC2_SYSDIV2LSB 1

//      <q> USBPWRDN: Power-Down USB PLL
//          <i> Check this box to disable the USB PLL.
//
// If the following value is 1, then the USB PLL is powered down.  Keep this
// value as 1 if you do not need to use the PLL. If you are using the USB PLL,
// then this value must be set to 0.
//
#define CFG_RCC2_USBPWRDN 0

//      <q> PWRDN2: Power Down PLL
//          <i> Check this box to disable the PLL.  You must also choose
//          <i> PLL Bypass.
//
// If the following value is 1, then the PLL is powered down.  Keep this value
// as 1 if you do not need to use the PLL.  In this case, BYPASS2 (see below)
// must also be set to 1.  If you are using the PLL, then this value must be
// set to 0.
//
#define CFG_RCC2_PWRDN2 0

//      <q> BYPASS2: Bypass PLL
//          <i> Check this box to not use the PLL for the System Clock
//
// Set the following value to 1 to bypass the PLL and not use it for the
// system clock.  You must set this to 1 if PWRDN2 (above) is set to 1.  Set
// this to 0 if you are using the PLL.
//
#define CFG_RCC2_BYPASS2 0

//      <o> OSCSRC2: Oscillator Source
//              <0=> 0: MOSC Main oscillator
//              <1=> 1: PIOSC Precision Internal oscillator (default)
//              <2=> 2: PIOSC/4 Precision Internal oscillator / 4 (this is necessary if used as input to PLL)
//              <3=> 3: 30kHz 30-kHz internal oscillator
//              <7=> 7: 32kHz 32.768-kHz external oscillator
//          <i> The oscillator that is used for the system clock, or the PLL input.
//
// The following value chooses the oscillator source according to the table in
// the comments above.
//
#define CFG_RCC2_OSCSRC2 0

//  </h>
//
//  </e>

//------------------ <<< end of configuration section >>> ----------------------

/*------------------------------------------------------------------------------
 *  Define clocks
 *----------------------------------------------------------------------------*/
#define MOSC_VALUE_1MHZ_PLLOFF                                       (1000000UL)
#define MOSC_VALUE_1_8432MHZ_PLLOFF                                  (1843200UL)
#define MOSC_VALUE_2MHZ_PLLOFF                                       (2000000UL)
#define MOSC_VALUE_2_4576MHZ_PLLOFF                                  (2457600UL)
#define MOSC_VALUE_3_579545MHZ                                       (3579545UL)
#define MOSC_VALUE_3_6864MHZ                                         (3686400UL)
#define MOSC_VALUE_4MHZ                                              (4000000UL)
#define MOSC_VALUE_4_096MHZ                                          (4096000UL)
#define MOSC_VALUE_4_9152MHZ                                         (4915200UL)
#define MOSC_VALUE_5MHZ                                              (5000000UL)
#define MOSC_VALUE_5_12MHZ                                           (5120000UL)
#define MOSC_VALUE_6MHZ_USB                                          (6000000UL)
#define MOSC_VALUE_6_144MHZ                                          (6144000UL)
#define MOSC_VALUE_7_3728MHZ                                         (7372800UL)
#define MOSC_VALUE_8MHZ_USB                                          (8000000UL)
#define MOSC_VALUE_8_192MHZ                                          (8192000UL)
#define MOSC_VALUE_10MHZ_USB                                        (10000000UL)
#define MOSC_VALUE_12MHZ_USB                                        (12000000UL)
#define MOSC_VALUE_12_288MHZ                                        (12288000UL)
#define MOSC_VALUE_13_56MHZ                                         (13560000UL)
#define MOSC_VALUE_14_31818MHZ                                      (14318180UL)
#define MOSC_VALUE_16MHZ_USB                                        (16000000UL)
#define MOSC_VALUE_16_384MHZ                                        (16384000UL)

#define PIOSC_VALUE_16MHZ                                           (16000000UL)

