MaxFlatline/LM3S9B92-CMSIS-DFP/Sources/Core/src/system_lm3s9b92.c
#define IOSC_VALUE_30KHZ                                               (30000UL)

#define HOSC_VALUE_32768HZ                                             (32768UL)

#define VCO_VALUE_400MHZ                                           (400000000UL)
#define VCO_PREDDIV2_VALUE_200MHZ                                  (200000000UL)

#define SYS_CLK_MAX                                                 (80000000UL)

/*------------------------------------------------------------------------------
 *  Clock Sources Macros
 *----------------------------------------------------------------------------*/
#define OSCSRC_MOSC                                               (0x00000000UL)
#define OSCSRC_PIOSC                                              (0x00000001UL)
#define OSCSRC_PIOSC_DIV4                                         (0x00000002UL)
#define OSCSRC_30KHZ                                              (0x00000003UL)

/*------------------------------------------------------------------------------
 *  Divisor Constraint Macros
 *----------------------------------------------------------------------------*/
#define MINSYSDIV_VCO400_DIV_5                                    (0x00000001UL)
#define MINSYSDIV_VCO400_DIV_6                                    (0x00000002UL)
#define MINSYSDIV_50MHZ_DIV4                                      (0x00000003UL)
#define MINSYSDIV_25MHZ_DIV8                                      (0x00000007UL)
#define MINSYSDIV_20MHZ_DIV10                                     (0x00000009UL)

/*------------------------------------------------------------------------------
 *  XTAL Types Macros
 *----------------------------------------------------------------------------*/
#define XTAL_NOPLL_1MHZ                                           (0x00000000UL)
#define XTAL_NOPLL_1_8432MHZ                                      (0x00000001UL)
#define XTAL_NOPLL_2MHZ                                           (0x00000002UL)
#define XTAL_NOPLL_2_4576MHZ                                      (0x00000003UL)
#define XTAL_3_579545MHZ                                          (0x00000004UL)
#define XTAL_3_6864MHZ                                            (0x00000005UL)
#define XTAL_4MHZ_USB                                             (0x00000006UL)
#define XTAL_4_096MHZ                                             (0x00000007UL)
#define XTAL_4_9152MHZ                                            (0x00000008UL)
#define XTAL_5MHZ_USB                                             (0x00000009UL)
#define XTAL_5_12MHZ                                              (0x0000000AUL)
#define XTAL_6MHZ_USB_DEFAULT                                     (0x0000000BUL)
#define XTAL_6_144MHZ                                             (0x0000000CUL)
#define XTAL_7_3728MHZ                                            (0x0000000DUL)
#define XTAL_8MHZ_USB                                             (0x0000000EUL)
#define XTAL_8_192MHZ                                             (0x0000000FUL)
#define XTAL_10MHZ_USB                                            (0x00000010UL)
#define XTAL_12MHZ_USB                                            (0x00000011UL)
#define XTAL_12_288MHZ                                            (0x00000012UL)
#define XTAL_13_56MHZ                                             (0x00000013UL)
#define XTAL_14_31818MHZ                                          (0x00000014UL)
#define XTAL_16MHZ_USB                                            (0x00000015UL)
#define XTAL_16_384MHZ                                            (0x00000016UL)

/*------------------------------------------------------------------------------
 *  Service macros
 *----------------------------------------------------------------------------*/
#define PLL_LOCK_TIMEOUT                                              (100000UL)
#define PLL_LOCK_DELAY                                                 (10000UL)
/*------------------------------------------------------------------------------
 *  Clock calculator
 *----------------------------------------------------------------------------*/
#if (CFG_RCC2_USERCC2)
    #if (CFG_RCC2_BYPASS2)
        #if (CFG_RCC2_OSCSRC2 == OSCSRC_MOSC)
            #if (CFG_RCC_XTAL == XTAL_NOPLL_1MHZ)
                #define __SYS_CLK_PRE XTAL_1MHZ_PLLOFF
            #elif (CFG_RCC_XTAL == XTAL_NOPLL_1_8432MHZ)
                #define __SYS_CLK_PRE XTAL_1_8432MHZ_PLLOFF
            #elif (CFG_RCC_XTAL == XTAL_NOPLL_2MHZ)
                #define __SYS_CLK_PRE XTAL_2MHZ_PLLOFF
            #elif (CFG_RCC_XTAL == XTAL_NOPLL_2_4576MHZ)
                #define __SYS_CLK_PRE XTAL_2_4576MHZ_PLLOFF
            #elif (CFG_RCC_XTAL == XTAL_3_579545MHZ)
              #define __SYS_CLK_PRE XTAL_3_579545MHZ
            #elif (CFG_RCC_XTAL == XTAL_3_6864MHZ)
                #define __SYS_CLK_PRE XTAL_3_6864MHZ
            #elif (CFG_RCC_XTAL == XTAL_4MHZ_USB)
                #define __SYS_CLK_PRE XTAL_4MHZ
            #elif (CFG_RCC_XTAL == XTAL_4_096MHZ)
                #define __SYS_CLK_PRE XTAL_4_096MHZ
            #elif (CFG_RCC_XTAL == XTAL_4_9152MHZ)
                #define __SYS_CLK_PRE XTAL_4_9152MHZ
            #elif (CFG_RCC_XTAL == XTAL_5MHZ_USB)
                #define __SYS_CLK_PRE XTAL_5MHZ
            #elif (CFG_RCC_XTAL == XTAL_5_12MHZ)
                #define __SYS_CLK_PRE XTAL_5_12MHZ
            #elif (CFG_RCC_XTAL == XTAL_6MHZ_USB_DEFAULT)
                #define __SYS_CLK_PRE XTAL_6MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_6_144MHZ)
                #define __SYS_CLK_PRE XTAL_6_144MHZ
            #elif (CFG_RCC_XTAL == XTAL_7_3728MHZ)
                #define __SYS_CLK_PRE XTAL_7_3728MHZ
            #elif (CFG_RCC_XTAL == XTAL_8MHZ_USB)
                #define __SYS_CLK_PRE XTAL_8MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_8_192MHZ)
                #define __SYS_CLK_PRE XTAL_8_192MHZ
            #elif (CFG_RCC_XTAL == XTAL_10MHZ_USB)
                #define __SYS_CLK_PRE  XTAL_10MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_12MHZ_USB)
                #define __SYS_CLK_PRE XTAL_12MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_12_288MHZ)
                #define __SYS_CLK_PRE XTAL_12_288MHZ
            #elif (CFG_RCC_XTAL == XTAL_13_56MHZ)
                #define __SYS_CLK_PRE XTAL_13_56MHZ
            #elif (CFG_RCC_XTAL == XTAL_14_31818MHZ)
                #define __SYS_CLK_PRE XTAL_14_31818MHZ
            #elif (CFG_RCC_XTAL == XTAL_16MHZ_USB)
                #define __SYS_CLK_PRE XTAL_16MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_16_384MHZ)
                #define __SYS_CLK_PRE XTAL_16_384MHZ
            #else
                #error "Incorrect XTAL setting!"
            #endif
        #elif (CFG_RCC2_OSCSRC2 == OSCSRC_PIOSC)
            #define __SYS_CLK_PRE PIOSC_VALUE_16MHZ
        #elif (CFG_RCC2_OSCSRC2 == OSCSRC_PIOSC_DIV4)
            #define __SYS_CLK_PRE (PIOSC_VALUE_16MHZ/4)
        #elif (CFG_RCC2_OSCSRC2 == OSCSRC_30KHZ)
            #define __SYS_CLK_PRE XTAL_INT30KHZ
        #else
            #error "Incorrect Clock setting!"
        #endif
        #if(CFG_RCC_USESYSDIV)
            #define __SYS_CLK (__SYS_CLK_PRE / (CFG_RCC2_SYSDIV2 + 1))
        #else
            #define __SYS_CLK (__SYS_CLK_PRE)
        #endif
    #elif (CFG_RCC2_PWRDN2 == 0)
        #if (CFG_RCC2_OSCSRC2 != OSCSRC_MOSC) && (CFG_RCC2_OSCSRC2 != OSCSRC_PIOSC)
            #error "PLL can ONLY be driven by MOSC or PIOSC!"
        #endif
        #if ((CFG_RCC2_OSCSRC2 == OSCSRC_MOSC)&&(CFG_RCC_XTAL <= XTAL_NOPLL_2_4576MHZ))
            #error "Incorrect XTAL selected!"
        #endif
        #if (CFG_RCC_USESYSDIV != 1)
            #error "Hardware forces USESYSDIV to 1 when PLL is enabled! Please check USESYSDIV box in Wizard."
        #endif
        #if(CFG_RCC2_DIV400)
            #define __SYS_CLK (VCO_VALUE_400MHZ / ((CFG_RCC2_SYSDIV2 << 1) + CFG_RCC2_SYSDIV2LSB + 1))
        #else
            #define __SYS_CLK (VCO_PREDDIV2_VALUE_200MHZ / (CFG_RCC2_SYSDIV2 + 1)) 
        #endif
    #else
        #error "PLL is powered down (CFG_RCC2_PWRDN2 is 1)! Cannot use PLL when BYPASS2=0."
    #endif
    #if (CFG_RCC2_OSCSRC2 == OSCSRC_PIOSC) || (CFG_RCC2_OSCSRC2 == OSCSRC_PIOSC_DIV4)
        #if (CFG_RCC_PIOSCDIS == 1)
            #error "Conflict in Wizard: PIOSC is selected as clock source, but CFG_RCC_PIOSCDIS is enabled!"
        #endif
    #endif

    #if (CFG_RCC2_OSCSRC2 == OSCSRC_MOSC)
        #if (CFG_RCC_MOSCDIS == 1)
            #error "Conflict in Wizard: MOSC (Crystal) is selected as clock source, but CFG_RCC_MOSCDIS is enabled!"
        #endif
    #endif
#else
    #if (CFG_RCC_BYPASS)
        #if (CFG_RCC_OSCSRC == OSCSRC_MOSC)
            #if (CFG_RCC_XTAL == XTAL_NOPLL_1MHZ)
                #define __SYS_CLK_PRE XTAL_1MHZ_PLLOFF
            #elif (CFG_RCC_XTAL == XTAL_NOPLL_1_8432MHZ)
                #define __SYS_CLK_PRE XTAL_1_8432MHZ_PLLOFF
            #elif (CFG_RCC_XTAL == XTAL_NOPLL_2MHZ)
                #define __SYS_CLK_PRE XTAL_2MHZ_PLLOFF
            #elif (CFG_RCC_XTAL == XTAL_NOPLL_2_4576MHZ)
                #define __SYS_CLK_PRE XTAL_2_4576MHZ_PLLOFF
            #elif (CFG_RCC_XTAL == XTAL_3_579545MHZ)
                #define __SYS_CLK_PRE XTAL_3_579545MHZ
            #elif (CFG_RCC_XTAL == XTAL_3_6864MHZ)
                #define __SYS_CLK_PRE XTAL_3_6864MHZ
            #elif (CFG_RCC_XTAL == XTAL_4MHZ_USB)
                #define __SYS_CLK_PRE XTAL_4MHZ
            #elif (CFG_RCC_XTAL == XTAL_4_096MHZ)
                #define __SYS_CLK_PRE XTAL_4_096MHZ
            #elif (CFG_RCC_XTAL == XTAL_4_9152MHZ)
                #define __SYS_CLK_PRE XTAL_4_9152MHZ
            #elif (CFG_RCC_XTAL == XTAL_5MHZ_USB)
                #define __SYS_CLK_PRE XTAL_5MHZ
            #elif (CFG_RCC_XTAL == XTAL_5_12MHZ)
                #define __SYS_CLK_PRE XTAL_5_12MHZ
            #elif (CFG_RCC_XTAL == XTAL_6MHZ_USB_DEFAULT)
                #define __SYS_CLK_PRE XTAL_6MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_6_144MHZ)
                #define __SYS_CLK_PRE XTAL_6_144MHZ
            #elif (CFG_RCC_XTAL == XTAL_7_3728MHZ)
                #define __SYS_CLK_PRE XTAL_7_3728MHZ
            #elif (CFG_RCC_XTAL == XTAL_8MHZ_USB)
                #define __SYS_CLK_PRE XTAL_8MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_8_192MHZ)
                #define __SYS_CLK_PRE XTAL_8_192MHZ
            #elif (CFG_RCC_XTAL == XTAL_10MHZ_USB)
                #define __SYS_CLK_PRE XTAL_10MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_12MHZ_USB)
                #define __SYS_CLK_PRE XTAL_12MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_12_288MHZ)
                #define __SYS_CLK_PRE XTAL_12_288MHZ
            #elif (CFG_RCC_XTAL == XTAL_13_56MHZ)
                #define __SYS_CLK_PRE XTAL_13_56MHZ
            #elif (CFG_RCC_XTAL == XTAL_14_31818MHZ)
                #define __SYS_CLK_PRE XTAL_14_31818MHZ
            #elif (CFG_RCC_XTAL == XTAL_16MHZ_USB)
                #define __SYS_CLK_PRE XTAL_16MHZ_USB
            #elif (CFG_RCC_XTAL == XTAL_16_384MHZ)
                #define __SYS_CLK_PRE XTAL_16_384MHZ
            #else
                #error "Incorrect XTAL setting!"
            #endif
        #elif (CFG_RCC_OSCSRC == OSCSRC_PIOSC)
            #define __SYS_CLK_PRE PIOSC_VALUE_16MHZ
        #elif (CFG_RCC_OSCSRC == OSCSRC_PIOSC_DIV4)
            #define __SYS_CLK_PRE (PIOSC_VALUE_16MHZ / 4)
        #elif (CFG_RCC_OSCSRC == OSCSRC_30KHZ)
            #define __SYS_CLK_PRE XTAL_INT30KHZ
        #else
            #error "Incorrect Clock setting!"
        #endif
        #if (CFG_RCC_USESYSDIV)
            #define __SYS_CLK  (__SYS_CLK_PRE / (CFG_RCC_SYSDIV + 1))
        #else
            #define __SYS_CLK  (__SYS_CLK_PRE)
        #endif
    #elif (CFG_RCC_PWRDN == 0)
        #if (CFG_RCC_OSCSRC != OSCSRC_MOSC) && (CFG_RCC_OSCSRC != OSCSRC_PIOSC)
            #error "PLL can ONLY be driven by MOSC or PIOSC!"
        #endif
        #if ((CFG_RCC_OSCSRC == OSCSRC_MOSC)&&(CFG_RCC_XTAL <= XTAL_NOPLL_2_4576MHZ))
            #error "Incorrect XTAL selected!"
        #endif
        #if (CFG_RCC_USESYSDIV != 1)
            #error "Hardware forces USESYSDIV to 1 when PLL is enabled! Please check USESYSDIV box in Wizard."
        #endif
        #define __SYS_CLK  (VCO_PREDDIV2_VALUE_200MHZ / (CFG_RCC_SYSDIV + 1))
    #else
        #error "Incorrect XTAL selected!"
    #endif
     #if (CFG_RCC_OSCSRC == OSCSRC_PIOSC) || (CFG_RCC_OSCSRC == OSCSRC_PIOSC_DIV4)
        #if (CFG_RCC_PIOSCDIS == 1)
            #error "Conflict in Wizard: PIOSC is selected as clock source, but CFG_RCC_IOSCDIS is enabled (1)!"
        #endif
    #endif

    #if (CFG_RCC_OSCSRC == OSCSRC_MOSC)
        #if (CFG_RCC_MOSCDIS == 1)
            #error "Conflict in Wizard: MOSC (Crystal) is selected as clock source, but CFG_RCC_MOSCDIS is enabled (1)!"
        #endif
    #endif
#endif

#if (__SYS_CLK  > SYS_CLK_MAX)
    #error "System Clock frequency exceeds the maximum allowed limit of 80 MHz for LM3S9B92!"
#endif

/*------------------------------------------------------------------------------
 *  System Core Clock Variable
 *----------------------------------------------------------------------------*/
uint32_t SystemCoreClock;  /* System Clock Frequency (Core Clock)*/

/*------------------------------------------------------------------------------
 *  Static Core Clock functions
 *----------------------------------------------------------------------------*/
__STATIC_INLINE uint32_t getOscClk (uint32_t xtal, uint32_t oscSrc);
__STATIC_INLINE uint32_t GetMinSysDiv(uint32_t minsysdiv);

/*------------------------------------------------------------------------------
 *  System Core Clock function
 *----------------------------------------------------------------------------*/
void SystemCoreClockUpdate (void) {
    uint32_t rcc, rcc2;
    uint32_t sysdiv, minsysdiv;
    uint32_t TempClock;
    
    rcc  = SYSCTL->RCC;
    rcc2 = SYSCTL->RCC2;
    minsysdiv = ((SYSCTL->DC1 & SYSCTL_DC1_MINSYSDIV_Msk) >> SYSCTL_DC1_MINSYSDIV_Pos);
    
    
