MaxFlatline/LM3S9B92-CMSIS-DFP/Sources/Core/src/system_lm3s9b92.c
    if ((rcc2 & SYSCTL_RCC2_USERCC2_Msk) == SYSCTL_RCC2_USERCC2_Msk) {
        if((rcc2 & SYSCTL_RCC2_BYPASS2_Msk) == SYSCTL_RCC2_BYPASS2_Msk) {
            TempClock = getOscClk(((rcc & SYSCTL_RCC_XTAL_Msk) >> SYSCTL_RCC_XTAL_Pos), ((rcc2 & SYSCTL_RCC2_OSCSRC2_Msk) >> SYSCTL_RCC2_OSCSRC2_Pos));
            if((rcc & SYSCTL_RCC_USESYSDIV_Msk) == SYSCTL_RCC_USESYSDIV_Msk) {
                sysdiv = (rcc2 & SYSCTL_RCC2_SYSDIV2_Msk) >> SYSCTL_RCC2_SYSDIV2_Pos;
                SystemCoreClock = TempClock / (sysdiv + 1);
            }
            else {
                SystemCoreClock = TempClock;
            }
        }
        else {
            if((rcc2 & SYSCTL_RCC2_DIV400_Msk) == SYSCTL_RCC2_DIV400_Msk){
                sysdiv = ((rcc2 & SYSCTL_RCC2_SYSDIV2_Msk) >> SYSCTL_RCC2_SYSDIV2_Pos);
                sysdiv = (sysdiv << 1) + ((rcc2 & SYSCTL_RCC2_SYSDIV2LSB_Msk) >> SYSCTL_RCC2_SYSDIV2LSB_Pos) + 1;
                if ((rcc & SYSCTL_RCC_USESYSDIV_Msk) == SYSCTL_RCC_USESYSDIV_Msk) {
                    minsysdiv = GetMinSysDiv((SYSCTL->DID1 & SYSCTL_DC1_MINSYSDIV_Msk) >> SYSCTL_DC1_MINSYSDIV_Pos);
                    if (sysdiv < minsysdiv) {
                        sysdiv = minsysdiv;
                    }
                }
                SystemCoreClock = VCO_VALUE_400MHZ / sysdiv;
            }
            else {
                sysdiv = ((rcc2 & SYSCTL_RCC2_SYSDIV2_Msk) >> (SYSCTL_RCC2_SYSDIV2_Pos + 1)) + 1;
                sysdiv = sysdiv << 1;
                if ((rcc & SYSCTL_RCC_USESYSDIV_Msk) == SYSCTL_RCC_USESYSDIV_Msk) {
                    minsysdiv = GetMinSysDiv((SYSCTL->DID1 & SYSCTL_DC1_MINSYSDIV_Msk) >> SYSCTL_DC1_MINSYSDIV_Pos);
                    if (sysdiv < minsysdiv) {
                        sysdiv = minsysdiv;
                    }
                }
                SystemCoreClock = VCO_VALUE_400MHZ / sysdiv;
            }
        }
    }
    else {
        if((rcc & SYSCTL_RCC_BYPASS_Msk) == SYSCTL_RCC_BYPASS_Msk) {
            TempClock = getOscClk(((rcc & SYSCTL_RCC_XTAL_Msk) >> SYSCTL_RCC_XTAL_Pos),((rcc & SYSCTL_RCC_OSCSRC_Msk) >> SYSCTL_RCC_OSCSRC_Pos));
            if((rcc & SYSCTL_RCC_USESYSDIV_Msk) == SYSCTL_RCC_USESYSDIV_Msk) {
                sysdiv = (rcc & SYSCTL_RCC_SYSDIV_Msk) >> SYSCTL_RCC_SYSDIV_Pos;
                SystemCoreClock = TempClock / (sysdiv + 1);
            } else {
                SystemCoreClock = TempClock;
            }
        }
        else {
            sysdiv = ((rcc & SYSCTL_RCC_SYSDIV_Msk) >> SYSCTL_RCC_SYSDIV_Pos) + 1;
            sysdiv = sysdiv << 1;
            if ((rcc & SYSCTL_RCC_USESYSDIV_Msk) == SYSCTL_RCC_USESYSDIV_Msk) {
                minsysdiv = GetMinSysDiv((SYSCTL->DID1 & SYSCTL_DC1_MINSYSDIV_Msk) >> SYSCTL_DC1_MINSYSDIV_Pos);
                if (sysdiv < minsysdiv) {
                    sysdiv = minsysdiv;
                }
            }
            SystemCoreClock = VCO_PREDDIV2_VALUE_200MHZ / sysdiv;
        }
    }
}

/*---------------------------------------------------------------------------
    System initialization function
 *---------------------------------------------------------------------------*/
void SystemInit (void) {
#if(CLOCK_SETUP)
    uint32_t rcc, rcc2, timeout;

    rcc  = SYSCTL->RCC;
    if(CFG_RCC2_USERCC2) {
        rcc2 = SYSCTL->RCC2;
        rcc &= ~(SYSCTL_RCC_XTAL_Msk      | SYSCTL_RCC_MOSCDIS_Msk | 
                 SYSCTL_RCC_USEPWMDIV_Msk | SYSCTL_RCC_PWMDIV_Msk  | 
                 SYSCTL_RCC_ACG_Msk);
                 
        rcc |= (CFG_RCC_XTAL       << SYSCTL_RCC_XTAL_Pos)       |
               (CFG_RCC_USEPWMDIV  << SYSCTL_RCC_USEPWMDIV_Pos)  |
               (CFG_RCC_PWMDIV     << SYSCTL_RCC_PWMDIV_Pos)     |
               (CFG_RCC_ACG        << SYSCTL_RCC_ACG_Pos);
        SYSCTL->RCC = rcc;
        
        rcc2 &= ~(SYSCTL_RCC2_OSCSRC2_Msk | SYSCTL_RCC2_SYSDIV2_Msk  | 
                  SYSCTL_RCC2_DIV400_Msk  | SYSCTL_RCC2_PWRDN2_Msk   | 
                  SYSCTL_RCC2_BYPASS2_Msk | SYSCTL_RCC2_USBPWRDN_Msk);
              
        rcc2 |=  (CFG_RCC2_OSCSRC2  << SYSCTL_RCC2_OSCSRC2_Pos)  |
                 (CFG_RCC2_SYSDIV2  << SYSCTL_RCC2_SYSDIV2_Pos)  |
                 (CFG_RCC2_PWRDN2   << SYSCTL_RCC2_PWRDN2_Pos)   |
                 (CFG_RCC2_USBPWRDN << SYSCTL_RCC2_USBPWRDN_Pos) |
                  SYSCTL_RCC2_BYPASS2_Msk;
#if (CFG_RCC2_DIV400)
        rcc2 |= SYSCTL_RCC2_DIV400_Msk;
        rcc2 &= ~SYSCTL_RCC2_SYSDIV2LSB_Msk;
        rcc2 |= (CFG_RCC2_SYSDIV2LSB << SYSCTL_RCC2_SYSDIV2LSB_Pos);
#endif
        rcc2 |= SYSCTL_RCC2_USERCC2_Msk;
        SYSCTL->RCC2 = rcc2;
        
#if (CFG_RCC2_BYPASS2 == 0)
        timeout = PLL_LOCK_TIMEOUT;
        while (((SYSCTL->RIS & SYSCTL_RIS_PLLLRIS_Msk) == 0) && (timeout > 0)) {
            timeout--;
        }

        if (timeout == 0) {
            rcc2 = SYSCTL->RCC2;
            rcc2 &= ~SYSCTL_RCC2_OSCSRC2_Msk;
            rcc2 |= (OSCSRC_PIOSC << SYSCTL_RCC2_OSCSRC2_Pos);
            rcc2 |= SYSCTL_RCC2_BYPASS2_Msk;
            SYSCTL->RCC2 = rcc2;
        } else {
            SYSCTL->RCC2 &= ~SYSCTL_RCC2_BYPASS2_Msk;
            for (volatile uint32_t delay = 0; delay < PLL_LOCK_DELAY; delay++){}
#if (CFG_RCC_PIOSCDIS == 1)
            if (CFG_RCC2_OSCSRC2 == OSCSRC_MOSC) {
                SYSCTL->RCC |= SYSCTL_RCC_IOSCDIS_Msk;
            }
#endif
#if (CFG_RCC_MOSCDIS == 1)
            if ((CFG_RCC2_OSCSRC2 == OSCSRC_PIOSC) || (CFG_RCC2_OSCSRC2 == OSCSRC_PIOSC_DIV4)) {
                SYSCTL->RCC |= SYSCTL_RCC_MOSCDIS_Msk;
            }
#endif
        }
#else
#if (CFG_RCC_PIOSCDIS == 1)
            if ((CFG_RCC2_OSCSRC2 == OSCSRC_MOSC) || (CFG_RCC2_OSCSRC2 == OSCSRC_30KHZ)) {
                SYSCTL->RCC |= SYSCTL_RCC_IOSCDIS_Msk;
            }
#endif
#if (CFG_RCC_MOSCDIS == 1)
            if ((CFG_RCC2_OSCSRC2 == OSCSRC_PIOSC) || (CFG_RCC2_OSCSRC2 == OSCSRC_PIOSC_DIV4) || (CFG_RCC2_OSCSRC2 == OSCSRC_30KHZ)) {
                SYSCTL->RCC |= SYSCTL_RCC_MOSCDIS_Msk;
            }
#endif
#endif
    }
    else {
        rcc &= ~(SYSCTL_RCC_XTAL_Msk      | SYSCTL_RCC_OSCSRC_Msk     |
                 SYSCTL_RCC_SYSDIV_Msk    | SYSCTL_RCC_PWRDN_Msk      |
                 SYSCTL_RCC_USESYSDIV_Msk | SYSCTL_RCC_BYPASS_Msk     |
                 SYSCTL_RCC_IOSCDIS_Msk   | SYSCTL_RCC_MOSCDIS_Msk    |
                 SYSCTL_RCC_USEPWMDIV_Msk | SYSCTL_RCC_PWMDIV_Msk     |
                 SYSCTL_RCC_ACG_Msk);

