MaxFlatline/LM3S9B92-CMSIS-DFP/Sources/Core/src/system_lm3s9b92.c
        rcc |=  (CFG_RCC_XTAL            << SYSCTL_RCC_XTAL_Pos)      |
                (CFG_RCC_OSCSRC          << SYSCTL_RCC_OSCSRC_Pos)    |
                (CFG_RCC_SYSDIV          << SYSCTL_RCC_SYSDIV_Pos)    |
                (CFG_RCC_PWRDN           << SYSCTL_RCC_PWRDN_Pos)     |
                (CFG_RCC_USESYSDIV       << SYSCTL_RCC_USESYSDIV_Pos) |
                (CFG_RCC_USEPWMDIV       << SYSCTL_RCC_USEPWMDIV_Pos) |
                (CFG_RCC_PWMDIV          << SYSCTL_RCC_PWMDIV_Pos)    |
                (CFG_RCC_ACG             << SYSCTL_RCC_ACG_Pos)       |
                SYSCTL_RCC_BYPASS_Msk;
        SYSCTL->RCC = rcc;
#if (CFG_RCC_BYPASS == 0)
        timeout = PLL_LOCK_TIMEOUT;
        while (((SYSCTL->RIS & SYSCTL_RIS_PLLLRIS_Msk) == 0) && (timeout > 0)) {
            timeout--;
        }

        if (timeout == 0) {
            rcc = SYSCTL->RCC;
            rcc &= ~SYSCTL_RCC_OSCSRC_Msk;
            rcc |= (0x1UL << SYSCTL_RCC_OSCSRC_Pos);
            rcc |= SYSCTL_RCC_BYPASS_Msk;
            SYSCTL->RCC = rcc;
        } else {
            SYSCTL->RCC &= ~SYSCTL_RCC_BYPASS_Msk;
            for (volatile uint32_t delay = 0; delay < PLL_LOCK_DELAY; delay++){}
#if (CFG_RCC_PIOSCDIS == 1)
            if (CFG_RCC_OSCSRC == OSCSRC_MOSC) {
                SYSCTL->RCC |= SYSCTL_RCC_IOSCDIS_Msk;
            }
#endif
#if (CFG_RCC_MOSCDIS == 1)
            if ((CFG_RCC_OSCSRC == OSCSRC_PIOSC) || (CFG_RCC_OSCSRC == OSCSRC_PIOSC_DIV4)) {
                SYSCTL->RCC |= SYSCTL_RCC_MOSCDIS_Msk;
            }
#endif
        }
#else
#if (CFG_RCC_PIOSCDIS == 1)
            if ((CFG_RCC_OSCSRC == OSCSRC_MOSC) || (CFG_RCC_OSCSRC == OSCSRC_30KHZ)) {
                SYSCTL->RCC |= SYSCTL_RCC_IOSCDIS_Msk;
            }
#endif
#if (CFG_RCC_MOSCDIS == 1)
            if ((CFG_RCC_OSCSRC == OSCSRC_PIOSC) || (CFG_RCC_OSCSRC == OSCSRC_PIOSC_DIV4) || (CFG_RCC_OSCSRC == OSCSRC_30KHZ)) {
                SYSCTL->RCC |= SYSCTL_RCC_MOSCDIS_Msk;
            }
#endif
#endif
    }
#endif
    SystemCoreClockUpdate();
}

/*------------------------------------------------------------------------------
 * Get the OSC clock
 *----------------------------------------------------------------------------*/
__STATIC_INLINE uint32_t getOscClk (uint32_t xtal, uint32_t oscSrc) {
    uint32_t oscClk = IOSC_VALUE_30KHZ;
    switch (oscSrc) {
        case OSCSRC_MOSC:
        switch (xtal) {
            case XTAL_NOPLL_1MHZ:
                oscClk = MOSC_VALUE_1MHZ_PLLOFF;
                break;
            case XTAL_NOPLL_1_8432MHZ:
                oscClk = MOSC_VALUE_1_8432MHZ_PLLOFF;
                break;
            case XTAL_NOPLL_2MHZ:
                oscClk = MOSC_VALUE_2MHZ_PLLOFF;
                break;
            case XTAL_NOPLL_2_4576MHZ:
                oscClk = MOSC_VALUE_2_4576MHZ_PLLOFF;
                break;
            case XTAL_3_579545MHZ:
                oscClk = MOSC_VALUE_3_579545MHZ;
                break;
            case XTAL_3_6864MHZ:
                oscClk = MOSC_VALUE_3_6864MHZ;
                break;
            case XTAL_4MHZ_USB:
                oscClk = MOSC_VALUE_4MHZ;
                break;
            case XTAL_4_096MHZ:
                oscClk = MOSC_VALUE_4_096MHZ;
                break;
            case XTAL_4_9152MHZ:
                oscClk = MOSC_VALUE_4_9152MHZ;
                break;
            case XTAL_5MHZ_USB:
                oscClk = MOSC_VALUE_5MHZ;
                break;
            case XTAL_5_12MHZ:
                oscClk = MOSC_VALUE_5_12MHZ;
                break;
            case XTAL_6MHZ_USB_DEFAULT:
                oscClk = MOSC_VALUE_6MHZ_USB;
                break;
            case XTAL_6_144MHZ:
                oscClk = MOSC_VALUE_6_144MHZ;
                break;
            case XTAL_7_3728MHZ:
                oscClk = MOSC_VALUE_7_3728MHZ;
                break;
            case XTAL_8MHZ_USB:
                oscClk = MOSC_VALUE_8MHZ_USB;
                break;
            case XTAL_8_192MHZ:
                oscClk = MOSC_VALUE_8_192MHZ;
                break;
            case XTAL_10MHZ_USB:
                oscClk = MOSC_VALUE_10MHZ_USB;
                break;
            case XTAL_12MHZ_USB:
                oscClk = MOSC_VALUE_12MHZ_USB;
                break;
            case XTAL_12_288MHZ:
                oscClk = MOSC_VALUE_12_288MHZ;
                break;
            case XTAL_13_56MHZ:
                oscClk = MOSC_VALUE_13_56MHZ;
                break;
            case XTAL_14_31818MHZ:
                oscClk = MOSC_VALUE_14_31818MHZ;
                break;
            case XTAL_16MHZ_USB:
                oscClk = MOSC_VALUE_16MHZ_USB;
                break;
            case XTAL_16_384MHZ:
                oscClk = MOSC_VALUE_16_384MHZ;
                break;
            default:
                oscClk = -1;
                break;
        }
        break;
            case OSCSRC_PIOSC:
            oscClk = PIOSC_VALUE_16MHZ;
        break;
        case OSCSRC_PIOSC_DIV4:
            oscClk = PIOSC_VALUE_16MHZ/4;
            break;
        case OSCSRC_30KHZ:
            oscClk = IOSC_VALUE_30KHZ;
            break;
        default:
            oscClk = -1;
            break;
    }
    return oscClk;
}

/*------------------------------------------------------------------------------
 * Get the min PLL400 divisor
 *----------------------------------------------------------------------------*/
__STATIC_INLINE uint32_t GetMinSysDiv(uint32_t minsysdiv) {
    switch (minsysdiv) {
        case MINSYSDIV_VCO400_DIV_5:
            return 5;
        case MINSYSDIV_VCO400_DIV_6:
            return 6;
        case MINSYSDIV_50MHZ_DIV4:
            return 8;
        case MINSYSDIV_25MHZ_DIV8:
            return 16;
        case MINSYSDIV_20MHZ_DIV10:
            return 20;
        default:
            return 5;
    }
}
